#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```

oci_budget_budget.stack_budget: Refreshing state... [id=ocid1.budget.oc1.iad.amaaaaaazrydlxyarasyzmsom2pja3kuvnaiu4z54ktmzx77h35b7baosh5a]
data.oci_identity_availability_domains.ads: Reading...
oci_load_balancer_load_balancer.k3s_lb: Refreshing state... [id=ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq]
oci_waf_web_app_firewall_policy.k3s_waf_policy: Refreshing state... [id=ocid1.webappfirewallpolicy.oc1.iad.amaaaaaazrydlxyagtpnoo3znk4iz6lwneo55zzezvzkd4on7mpa2omaronq]
oci_mysql_mysql_db_system.grafana_db: Refreshing state... [id=ocid1.mysqldbsystem.oc1.iad.aaaaaaaadclranruehn3mg7wd3xbfpb53bebcaz66pyz2drn6ndbphx6dw7q]
oci_core_instance.k3s_instance: Refreshing state... [id=ocid1.instance.oc1.iad.anuwcljszrydlxycucjtok26faxzdaxu5s3apmygqaej5kq7n5oh5vjxunpq]
data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-1063911866]
oci_budget_alert_rule.stack_budget_alert: Refreshing state... [id=ocid1.alertrule.oc1.iad.amaaaaaazrydlxyacdt64pnuwjp7ciqsyrffx4zffx6mcymtq5rsqwmncgzq]
oci_load_balancer_backend_set.k3s_backend_set_443: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set-443]
oci_load_balancer_backend_set.k3s_backend_set: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set]
oci_waf_web_app_firewall.k3s_waf: Refreshing state... [id=ocid1.webappfirewall.oc1.iad.amaaaaaazrydlxya5fte37a3vjaldjuzxk3xjemvr4ps7lfmblhz2dnm2fsa]
oci_load_balancer_listener.k3s_listener_80: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/listeners/http-listener]
oci_load_balancer_backend.k3s_backend_80: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set/backends/10.0.0.165:80]
oci_load_balancer_backend.k3s_backend_443: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/backendSets/k3s-backend-set-443/backends/10.0.0.165:443]
oci_load_balancer_listener.k3s_listener_443: Refreshing state... [id=loadBalancers/ocid1.loadbalancer.oc1.iad.aaaaaaaau5wpphr7ntl4vxtefpvcjkiyz2aurtpvtszmgok5jmazkx2ykvxq/listeners/https-listener]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_bastion_bastion.k3s_bastion will be created
  + resource "oci_bastion_bastion" "k3s_bastion" {
      + bastion_type                  = "STANDARD"
      + client_cidr_block_allow_list  = [
          + "0.0.0.0/0",
        ]
      + compartment_id                = "ocid1.tenancy.oc1..aaaaaaaa3gi23m2ydmg7xa46xsae4wa2mmcmkshncwgt7zldhc3eamb3ovzq"
      + defined_tags                  = (known after apply)
      + dns_proxy_status              = (known after apply)
      + freeform_tags                 = (known after apply)
      + id                            = (known after apply)
      + lifecycle_details             = (known after apply)
      + max_session_ttl_in_seconds    = 3600
      + max_sessions_allowed          = (known after apply)
      + name                          = "k3s-bastion"
      + phone_book_entry              = (known after apply)
      + private_endpoint_ip_address   = (known after apply)
      + security_attributes           = (known after apply)
      + state                         = (known after apply)
      + static_jump_host_ip_addresses = (known after apply)
      + system_tags                   = (known after apply)
      + target_subnet_id              = "ocid1.subnet.oc1.iad.aaaaaaaawawazjmxe3w22yttmhbewwm3pbfiagebllxucdpzejt5ddjydoqa"
      + target_vcn_id                 = (known after apply)
      + time_created                  = (known after apply)
      + time_updated                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_id              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>